# 함수 매핑

- 시리즈 또는 데이터프레임의 개별 원소를 특정 함수에 일대일 대응시키는 과정
    - 사용자가 직접 만든 함수를 적용할 수 있기 때문에 판다스 기본 함수로 처리하기 어려운 복잡한 연산을 적용하는 것이 가능

## 개별 원소에 함수 매핑

### 시리즈 원소에 함수 매핑

- 시리즈에 map()을 적용하면 인자로 전달받는 매핑 함수에 시리즈의 모든 원소를 하나씩 입력하고 리턴값을 받음
    - 시리즈 원소의 개수만큼 리턴값을 받아서 같은 크기의 시리즈 객체로 변환
    
- 시리즈의 각 원소에 함수를 적용

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
se = pd.Series([1, 2, 3, 4, 5])

In [3]:
se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# 시리즈의 각 원소에 2를 곱한 결과 반환
se.map(lambda x: x * 2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [6]:
def mul_2(n):
    return n * 2

In [7]:
se.map(mul_2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [8]:
titanic = sns.load_dataset("titanic")

In [9]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
titanic["age"].map(mul_2)

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: age, Length: 891, dtype: float64

In [11]:
titanic["age"].map(lambda x : x * 2)

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: age, Length: 891, dtype: float64

In [12]:
titanic["age"].map(lambda x : x * 10)

0      220.0
1      380.0
2      260.0
3      350.0
4      350.0
       ...
886    270.0
887    190.0
888      NaN
889    260.0
890    320.0
Name: age, Length: 891, dtype: float64

### 데이터프레임 원소에 함수 매핑

- applymap()
    - 데이터프레임의 각 원소를 하나씩 넣어서 리턴값으로 돌려받음
    - 데이터프레임의 각 원소에 함수를 적용

In [13]:
df = pd.DataFrame({"A" : [1,2,3],
                   "B" : [4,5,6]})

In [14]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [15]:
df.applymap(lambda x : x * 2)

   A   B
0  2   8
1  4  10
2  6  12

In [16]:
titanic[["age", "fare"]].applymap(lambda x : x * 2)

      age      fare
0    44.0   14.5000
1    76.0  142.5666
2    52.0   15.8500
3    70.0  106.2000
4    70.0   16.1000
..    ...       ...
886  54.0   26.0000
887  38.0   60.0000
888   NaN   46.9000
889  52.0   60.0000
890  64.0   15.5000

[891 rows x 2 columns]

In [17]:
df.applymap(mul_2)

   A   B
0  2   8
1  4  10
2  6  12

## 데이터프레임 객체에 함수 매핑

- apply()
    - 데이터프레임의 열 또는 행에 함수를 적용

In [18]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [21]:
# 열의 합계 
df.apply(lambda x : sum(x), axis = 0)

A     6
B    15
dtype: int64

In [22]:
# 행의 합계
df.apply(lambda x : sum(x), axis = 1)

0    5
1    7
2    9
dtype: int64

In [24]:
def sum_se(se):
    return sum(se)

In [25]:
df.apply(sum_se, axis = 0)

A     6
B    15
dtype: int64

In [26]:
df.apply(sum_se, axis = 1)

0    5
1    7
2    9
dtype: int64

In [29]:
titanic.apply(lambda x : x["age"] + x["fare"], axis = 1)

0       29.2500
1      109.2833
2       33.9250
3       88.1000
4       43.0500
         ...
886     40.0000
887     49.0000
888         NaN
889     56.0000
890     39.7500
Length: 891, dtype: float64